# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех элементов.

# TODO: your code here
list = [-10, 4, -10, 9, 2, 0, -1 -4, -10]

for lis in list:
    lis += lis
print(lis)
